// * === Свойства компонентов "пропсы" (127) === * \\

// * Если мы откроем какой-то интернет-магазин, то мы можем увидеть много однотипных карточек товаров, которые отличаются контентом: картинкой, подписью, ценой и т.д. На уровне структуры это одно и то же, только с разным контентом. Все эти однотипные элементы на сайте могут быть созданы лишь одним реакт-компонентом. Например, компоненты ссылок, компоненты карточек товаров и др., что можно представить в виден шаблонизации. Они структурно одинаковы и выполняют одинаковые операции, но с разным контентом. У компонента есть разные свойства, которые можно задавать, делая элементы отличающимися друг от друга, не смотря на одинаковую структуру.

// * Если вспомнить предыдущие уроки нативного JS, когда мы из данных, приходящих с сервера с помощью JS-классов формировали элементы, то здесь примерно тоже самое.

// todo Для тестирования перейдём в [projects/react-project-1/src/App.js].

// |===:===:===:===>
/** links:
 * (EN Новая документация): https://react.dev/learn/passing-props-to-a-component
 * (Базовая документация): https://ru.reactjs.org/docs/components-and-props.html
 * (Перевод новой документации): https://reactdev.ru/learn/passing-props-to-a-component/
 * */
