// * === Реакт-фрагменты (137) === * \\

// ? 1.0.0 Мы уже знаем, что в реакте, когда у нас есть какая-то структура компонента, то мы её всегда оборачиваем в родительский тег, например <div>. Это правило JSX. В реальной же вёрстке используются какие-то стили, часто нам этот лишний тег будет только мешать (там где Grid & Flexbox или 100% ширины, например). Было бы хорошо мочь обойти эту проблему с этим дополнительным div’ом. как раз для таких ситуаций и были созданы реакт-фрагменты. 
// * 1.1.0 Их можно использовать двумя способами:
// todo Потренируемся на [projects/react-project-1/src/App.js].

// |===:===:===:===>
/** links:
 * (EN Новая документация): https://react.dev/reference/react/Fragment#fragment
 * (Базовая документация): https://ru.reactjs.org/docs/fragments.html
 * (Перевод новой документации): https://reactdev.ru/reference/Fragment/#_3
*/
