// * === Стили в React Inline Styles (140) === * \\

// ? Если приложение у нас большое, то что делать со стилями, когда мы создаём приложение?
// * Иногда приложение сперва верстается, а уже потом оживляется при помощи реакта. В таких случая всё просто, мы просто используем готовые стили, часто уже разбитые на правильные модули.
// * Однако бывает и так, что мы прописываем стили по ходу создания приложения. 
// ? На этом курсе мы рассмотрим разные возможные варианты и методы работы. Какой из них использовать решайте уже исходя из задачи и предпочтения.

// * В этой части мы затронем самый маленький и базовый способ работы со стилями — "инлайн-стили". 
// ? Из вёрстки мы знаем, что это не самый предпочтительный из способов написания стилей, но иногда он незаменим, особенно, когда дело касается динамически изменяемого контента. А во всех остальных случаях предпочтительнее всё же использовать CSS-классы.
// * Для того, чтобы назначить инлайн-стиль нам понадобится атрибут style="".

// todo Рассмотрим подробнее на примере: [перейдём в projects\react-project-2-employees\src\components\employees-list-item\employees-list-item.jsx]

// |===:===:===:===>
/** links:
 * none
*/
