// * === Поля классов (class fields) и static (145) === * \\

// * 1.0 Одну из фич полей классов мы уже использовали на протяжении конструирования Employees List App, а именно использовали стрелочные функции, чтобы закрепить за ними "контекст вызова" (this). Это намного угоднее, чем каждый раз биндить методы к экземпляру класса.
// * 1.1.0 Вторая фича полей классов — создание любых свойств без конструктора.

// todo для примера: [перейдём в react-project-2-employees\src\components\employee-add-form\employee-add-form.jsx]

// ? Обе эти опции могут быть весьма полезными в определённых ситуациях. Например статические методы для создания своей мини-библиотеки, а статические свойства, чтобы на один класс и на все его внутренние сущности была какая-то переменная, которую можно как-то использовать (например значение ширины чего-то и т.п.).

// |===:===:===:===>
/** links:
*  (Документация Class fields): https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Classes/Public_class_fields
*  (Документация static): https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Classes/static
*/
