// * === Стили в React. Готовые библиотеки компонентов со стилями (144) === * \\

// ? В веб-приложениях, как и в обычных сайтах, когда не требуется особенной и уникальной стилистики, а на первый план выходит функционал, иногда используют набор готовых компонентов. Вспомним очень популярный Bootstrap, где мы просто брали какие-то классы, интерактивные компоненты, анимации и получали то, что нужно.
// ? Когда мы верстаем какие-то админки или приложения для внутреннего пользования внутри компании, то там какие-то уникальные стили редко требуются. Главное, чтобы работало и было удобно и выглядело современно.
// ? Но в каких-то реальных приложениях, ориентированных на широкого пользователя нам возможно потребуется работать с готовыми шаблонами.

// * 1.0.0 Начнём мы с библиотеки React Bootstrap, чтобы потренироваться как это работает. (Есть также и альтернативные библиотеки даже для Bootstrap, ссылки ниже. ↓)
// ? 1.0.1 Эти библиотеки создают из тех элементов, что были в оригинальном Bootstrap — Реакт-компоненты, которые мы легко можем имплементировать к себе в проект.

// todo Потренируемся на самом первом тестовом Реакт-проекте [projects\react-project-1\src\App.js]

// |===:===:===:===>
/** links:
*  (ant.design): https://ant.design/
*  (CSS Modules): https://habr.com/ru/post/335244/
*  (Material Design): https://material-ui.com/ru/
*  (reactbootstrap): https://react-bootstrap.github.io/
*  (reactstrap): https://reactstrap.github.io/
*/
