// * === Специализация и наследование (157) === * \\

// ? Это одна из тем, которую спрашивают на собеседованиях.

// * Во время изучения классов мы видели, что у них есть наследование. Мы постоянно используем наследование для классовых компонентов React. А есть ли где-то наследование ещё в React? Ведь если подумать, то у нас постоянно встречаются компоненты, как частные случаи других компонентов. Всё те же боковые меню, модальные окна, списки и т.п. Пока у нас было мало таких элементов, но в крупных приложения они будут нередко встречаться.

// todo 1 Для наглядности перейдём в [projects\react-project-1\src\App.js]

// |===:===:===:===>
/** links:
*/